# Nitesh Kumar 23MB0042 MBA BA

In [ ]:
import mysql.connector

In [2]:
from mysql.connector import pooling

In [3]:
cnx=mysql.connector.connect(
host="localhost",
port=3306,
user="root",
password="12345678",
database="adbms_lab")

In [4]:
#create a cursor to execute sql queries
cur=cnx.cursor()

In [5]:
cur.execute("SELECT name FROM instructor where salary > some(select salary from instructor where dept_name='Biology');")

In [6]:
result = cur.fetchall()
for row in result:
    print(row)

('Wu',)
('Einstein',)
('Gold',)
('Katz',)
('Singh',)
('Crick',)
('Brandt',)
('Kim',)

In [7]:
cur.execute("SELECT name FROM instructor where salary > all(select salary from instructor where dept_name='Biology');")

In [8]:
result = cur.fetchall()
for row in result:
    print(row)

In [9]:
cur.execute("SELECT dept_name,avg(salary) FROM instructor group by dept_name having avg(salary) > 42000;")

In [10]:
result = cur.fetchall()
for row in result:
    print(row)

('Computer Science', 70000.0)
('Biology', 69000.0)
('Finance', 85000.0)
('Physics', 91000.0)
('History', 61000.0)
('ComputerScience', 92000.0)
('ElectricalEngineering', 80000.0)

In [11]:
cur.execute("SELECT dept_name,sum(salary),avg(salary) FROM instructor group by dept_name having sum(salary) > avg(salary);")

In [12]:
result = cur.fetchall()
for row in result:
    print(row)

('Computer Science', 140000.0, 70000.0)
('Biology', 138000.0, 69000.0)
('Finance', 170000.0, 85000.0)
('Physics', 182000.0, 91000.0)
('History', 122000.0, 61000.0)

In [13]:
cur.execute("SELECT name,teaches.course_id from instructor join teaches on instructor.id=teaches.id;")

In [14]:
result = cur.fetchall()
for row in result:
    print(row)

('Srinivasan', 'CS-101')
('Srinivasan', 'CS-315')
('Srinivasan', 'CS-347')
('Wu', 'FIN-201')
('Mozart', 'MU-199')
('Einstein', 'HY-101')
('El Said0', 'HIS-351')
('Katz', 'CS-101')
('Katz', 'CS-319')
('Crick', 'BIO-101')
('Crick', 'BIO-301')
('Brandt', 'CS-190')
('Brandt', 'CS-190')
('Brandt', 'CS-319')
('Kim', 'EE-181')

In [15]:
cur.execute("SELECT name,teaches.course_id from instructor left outer join teaches on instructor.id=teaches.id;")

In [16]:
result = cur.fetchall()
for row in result:
    print(row)

('Srinivasan', 'CS-101')
('Srinivasan', 'CS-315')
('Srinivasan', 'CS-347')
('Smith', None)
('Tom', None)
('Wu', 'FIN-201')
('Mozart', 'MU-199')
('Einstein', 'HY-101')
('El Said0', 'HIS-351')
('Gold', None)
('Katz', 'CS-101')
('Katz', 'CS-319')
('Califieri', None)
('Singh', None)
('Crick', 'BIO-101')
('Crick', 'BIO-301')
('Brandt', 'CS-190')
('Brandt', 'CS-190')
('Brandt', 'CS-319')
('Kim', 'EE-181')

In [17]:
cur.execute("create view faculty as select id,name,dept_name from instructor;")

In [18]:
cur.execute("create view sal_totals as select dept_name,sum(salary) from instructor group by dept_name;")

In [19]:
cur.execute("create role student;")

In [20]:
cur.execute("grant select on faculty to student;")

In [21]:
import pandas as pd

In [22]:
data_instructor=pd.read_csv("instructor.csv")

In [23]:
data_teaches=pd.read_csv("teaches.csv")

In [24]:
biology_max_salary = data_instructor[data_instructor['dept_name'] == 'Biology']['salary'].max()

result = data_instructor[data_instructor['salary'] > biology_max_salary]['name']

In [25]:
result

3           Wu
5     Einstein
7         Gold
8         Katz
10       Singh
12      Brandt
13         Kim
Name: name, dtype: object

In [26]:
avg_salary = data_instructor.groupby('dept_name')['salary'].mean()

selected_departments = avg_salary[avg_salary> 42000].index.tolist()

result = data_instructor[data_instructor['dept_name'].isin(selected_departments)].groupby('dept_name')['salary'].mean()

In [27]:
result

dept_name
Biology                  69000.0
Computer Science         70000.0
ComputerScience          92000.0
ElectricalEngineering    80000.0
Finance                  85000.0
History                  61000.0
Physics                  91000.0
Name: salary, dtype: float64

In [28]:
total_salary_by_dept = data_instructor.groupby('dept_name')['salary'].sum()

average_total_salary = total_salary_by_dept.mean()

selected_departments = total_salary_by_dept[total_salary_by_dept > average_total_salary].index.tolist()

In [29]:
selected_departments

['Biology', 'Computer Science', 'Finance', 'History', 'Physics']

In [30]:
result = pd.merge(data_instructor, data_teaches, left_on='id', right_on='id')

In [31]:
result[['name',"course_id"]]

          name course_id
0   Srinivasan    CS-101
1   Srinivasan    CS-315
2   Srinivasan    CS-347
3           Wu   FIN-201
4       Mozart    MU-199
5     Einstein    HY-101
6     El Said0   HIS-351
7         Katz    CS-101
8         Katz    CS-319
9        Crick   BIO-101
10       Crick   BIO-301
11      Brandt    CS-190
12      Brandt    CS-190
13      Brandt    CS-319
14         Kim    EE-181

In [32]:
result = pd.merge(data_instructor, data_teaches, left_on='id', right_on='id',how='left')

In [33]:
result[['name',"course_id"]]

          name course_id
0   Srinivasan    CS-101
1   Srinivasan    CS-315
2   Srinivasan    CS-347
3        Smith       NaN
4          Tom       NaN
5           Wu   FIN-201
6       Mozart    MU-199
7     Einstein    HY-101
8     El Said0   HIS-351
9         Gold       NaN
10        Katz    CS-101
11        Katz    CS-319
12   Califieri       NaN
13       Singh       NaN
14       Crick   BIO-101
15       Crick   BIO-301
16      Brandt    CS-190
17      Brandt    CS-190
18      Brandt    CS-319
19         Kim    EE-181

In [34]:
import time

In [35]:
starttime_sql=time.time()

In [36]:
cur.execute("SELECT name,teaches.course_id from instructor left outer join teaches on instructor.id=teaches.id;")

In [37]:
endtime_sql=time.time()

In [38]:
execution_time_sql = endtime_sql - starttime_sql

In [39]:
starttime_py=time.time()

In [40]:
result = pd.merge(data_instructor, data_teaches, left_on='id', right_on='id',how='left')

In [41]:
endtime_py=time.time()

In [42]:
execution_time_py = endtime_py - starttime_py

In [43]:
execution_time_sql

0.022913455963134766

In [44]:
execution_time_py

0.016382455825805664